In [5]:
import numpy as np
import pandas as pd

In [303]:
#1 Create a pandas DataFrame from the following dictionary and display it:
# data = {'Name': ['Alice', 'Bob', 'Charlie'], 'Age': [25, 30, 35], 'City': ['New York', 'Paris', 'London']}
# df = ?

info=pd.DataFrame({'Name': ['Alice', 'Bob', 'Charlie'], 'Age': [25, 30, 35], 'City': ['New York', 'Paris', 'London']})
print(info)

      Name  Age      City
0    Alice   25  New York
1      Bob   30     Paris
2  Charlie   35    London

In [305]:
#2 Load a CSV file named data.csv into a DataFrame. df = ?

#convert to csv file
info.to_csv('data.csv', index = False)

#store csv file in dataframe and print
data_df = pd.read_csv('data.csv')
print(data_df)

      Name  Age      City
0    Alice   25  New York
1      Bob   30     Paris
2  Charlie   35    London

In [307]:
#3. Display the first 10 rows of a DataFrame. result = ?

#get a csv file from stored location on your pc by copy path
rand = pd.read_csv(r'D:\python\Matplotlib\gas_prices.csv')
print(rand)

    Year  Australia  Canada  France  Germany  Italy  Japan  Mexico  \
0   1990        NaN    1.87    3.63     2.65   4.59   3.16    1.00
1   1991       1.96    1.92    3.45     2.90   4.50   3.46    1.30
2   1992       1.89    1.73    3.56     3.27   4.53   3.58    1.50
3   1993       1.73    1.57    3.41     3.07   3.68   4.16    1.56
4   1994       1.84    1.45    3.59     3.52   3.70   4.36    1.48
5   1995       1.95    1.53    4.26     3.96   4.00   4.43    1.11
6   1996       2.12    1.61    4.41     3.94   4.39   3.64    1.25
7   1997       2.05    1.62    4.00     3.53   4.07   3.26    1.47
8   1998       1.63    1.38    3.87     3.34   3.84   2.82    1.49
9   1999       1.72    1.52    3.85     3.42   3.87   3.27    1.79
10  2000       1.94    1.86    3.80     3.45   3.77   3.65    2.01
11  2001       1.71    1.72    3.51     3.40   3.57   3.27    2.20
12  2002       1.76    1.69    3.62     3.67   3.74   3.15    2.24
13  2003       2.19    1.99    4.35     4.59   4.53   3.47    2.04
14  2004       2.72    2.37    4.99     5.24   5.29   3.93    2.03
15  2005       3.23    2.89    5.46     5.66   5.74   4.28    2.22
16  2006       3.54    3.26    5.88     6.03   6.10   4.47    2.31
17  2007       3.85    3.59    6.60     6.88   6.73   4.49    2.40
18  2008       4.45    4.08    7.51     7.75   7.63   5.74    2.45

    South Korea    UK   USA
0          2.05  2.82  1.16
1          2.49  3.01  1.14
2          2.65  3.06  1.13
3          2.88  2.84  1.11
4          2.87  2.99  1.11
5          2.94  3.21  1.15
6          3.18  3.34  1.23
7          3.34  3.83  1.23
8          3.04  4.06  1.06
9          3.80  4.29  1.17
10         4.18  4.58  1.51
11         3.76  4.13  1.46
12         3.84  4.16  1.36
13         4.11  4.70  1.59
14         4.51  5.56  1.88
15         5.28  5.97  2.30
16         5.92  6.36  2.59
17         6.21  7.13  2.80
18         5.83  7.42  3.27

In [309]:
#print only 10 rowa
result = rand.head(10)
print(result)

   Year  Australia  Canada  France  Germany  Italy  Japan  Mexico  \
0  1990        NaN    1.87    3.63     2.65   4.59   3.16    1.00
1  1991       1.96    1.92    3.45     2.90   4.50   3.46    1.30
2  1992       1.89    1.73    3.56     3.27   4.53   3.58    1.50
3  1993       1.73    1.57    3.41     3.07   3.68   4.16    1.56
4  1994       1.84    1.45    3.59     3.52   3.70   4.36    1.48
5  1995       1.95    1.53    4.26     3.96   4.00   4.43    1.11
6  1996       2.12    1.61    4.41     3.94   4.39   3.64    1.25
7  1997       2.05    1.62    4.00     3.53   4.07   3.26    1.47
8  1998       1.63    1.38    3.87     3.34   3.84   2.82    1.49
9  1999       1.72    1.52    3.85     3.42   3.87   3.27    1.79

   South Korea    UK   USA
0         2.05  2.82  1.16
1         2.49  3.01  1.14
2         2.65  3.06  1.13
3         2.88  2.84  1.11
4         2.87  2.99  1.11
5         2.94  3.21  1.15
6         3.18  3.34  1.23
7         3.34  3.83  1.23
8         3.04  4.06  1.06
9         3.80  4.29  1.17

In [311]:
#4. Select only the Name and Age columns from the DataFrame. result = ?

result = info[['Name', 'Age']]
print(result)

      Name  Age
0    Alice   25
1      Bob   30
2  Charlie   35

In [313]:
#5. Find the shape (number of rows and columns) of the DataFrame. result = ?

result = info.shape
print(f"Number of rows: {result[0]}, Number of columns: {result[1]}")

Number of rows: 3, Number of columns: 3

In [315]:
#6. Check if there are any missing values in the DataFrame. result = ?

result = info.isnull()
print(result)

    Name    Age   City
0  False  False  False
1  False  False  False
2  False  False  False

In [317]:
#7. Add a new column Country to the DataFrame with a default value of 'USA'. df['Country'] = ?

info['Country'] = ['USA','France', 'UK']
print(info)

      Name  Age      City Country
0    Alice   25  New York     USA
1      Bob   30     Paris  France
2  Charlie   35    London      UK

In [319]:
#8. Delete the City column from the DataFrame. df = ?

#deleting column so mention axis
info_c = info.drop('City', axis=1)
print(info_c)

      Name  Age Country
0    Alice   25     USA
1      Bob   30  France
2  Charlie   35      UK

In [321]:
#9. Rename the column Age to Years. df = ?

info_age = info.rename(columns={'Age': 'Years'})
print(info_age)

      Name  Years      City Country
0    Alice     25  New York     USA
1      Bob     30     Paris  France
2  Charlie     35    London      UK

In [323]:
#10. Save the DataFrame to a new CSV file called output.csv. 
#df.to_csv(?, index=False)

info.to_csv('output.csv', index=False)

In [325]:
#save csv file into dataframe
output_df = pd.read_csv('output.csv')
print(output_df)

      Name  Age      City Country
0    Alice   25  New York     USA
1      Bob   30     Paris  France
2  Charlie   35    London      UK

In [327]:
#11. Filter rows where the Age column is greater than 30. filtered_df = ?

filtered_df= info[info['Age'] > 30]
print(filtered_df)

      Name  Age    City Country
2  Charlie   35  London      UK

In [329]:
#12. Add a new column Age_Group to classify Age as 'Young' (Age <= 30) or 'Old' (Age > 30).
#df['Age_Group'] = ?

info['Age_Group']=info['Age'].apply(lambda x: 'Old' if x > 30 else 'Young')
print(info)

      Name  Age      City Country Age_Group
0    Alice   25  New York     USA     Young
1      Bob   30     Paris  France     Young
2  Charlie   35    London      UK       Old

In [331]:
#13. Sort the DataFrame by the Age column in descending order.
# sorted_df = ?

sorted_df=info.sort_values(by='Age',ascending=False)
print(sorted_df)

      Name  Age      City Country Age_Group
2  Charlie   35    London      UK       Old
1      Bob   30     Paris  France     Young
0    Alice   25  New York     USA     Young

In [333]:
#14. Calculate the mean, median, and standard deviation of the Age column.
#mean = ?
#median = ?
#std_dev = ?

mean = info['Age'].mean()

median = info['Age'].median()

std_dev = info['Age'].std()

print('mean: ', mean)
print('median: ', median)
print('standard deviation :',std_dev)

mean:  30.0
median:  30.0
standard deviation : 5.0

In [335]:
#15. Find the unique values in the City column. unique_cities = ?

print(info)
print('*'*50)
unique_cities = info['City'].unique()
print(unique_cities)

      Name  Age      City Country Age_Group
0    Alice   25  New York     USA     Young
1      Bob   30     Paris  France     Young
2  Charlie   35    London      UK       Old
**************************************************
['New York' 'Paris' 'London']

In [337]:
#16. Count the occurrences of each unique value in the City column.
# city_counts = ?

city_counts = info['City'].value_counts()
print(city_counts)

City
New York    1
Paris       1
London      1
Name: count, dtype: int64

In [339]:
#17. Concatenate two DataFrames df1 and df2 vertically.
# result = ?

df1=pd.DataFrame({'Clothes': ['top','shirts','tshirts'], 'price': [100,20,3]})
df2=pd.DataFrame({'Shoes': ['boots','heels','scandals'], 'price': [10,6,9]})

In [341]:
#vertically=column wise
result=pd.concat([df1,df2],axis=0, ignore_index=True)
print(result)

   Clothes  price     Shoes
0      top    100       NaN
1   shirts     20       NaN
2  tshirts      3       NaN
3      NaN     10     boots
4      NaN      6     heels
5      NaN      9  scandals

In [343]:
#18. Merge two DataFrames df1 and df2 on a common column.
# result = ?

df1=pd.DataFrame({'Name': ['tara','lara','tanish'], 'age': [100,27,32]})
df2=pd.DataFrame({'Name': ['birla','tara','tanish'], 'salary': [100,62,90]})

result = pd.merge(df1,df2,on='Name')
print(result)

     Name  age  salary
0    tara  100      62
1  tanish   32      90

In [345]:
#19. Pivot the DataFrame to show the average Age for each City in rows and Country in columns.
# pivot = ?

print(info)
print('*'*50)

pivot = info.pivot_table(values='Age', index='City', columns='Country', aggfunc='mean')

print(pivot)

      Name  Age      City Country Age_Group
0    Alice   25  New York     USA     Young
1      Bob   30     Paris  France     Young
2  Charlie   35    London      UK       Old
**************************************************
Country   France    UK   USA
City
London       NaN  35.0   NaN
New York     NaN   NaN  25.0
Paris       30.0   NaN   NaN

In [374]:
#20. Drop all rows with missing values in the DataFrame.
# cleaned_df = ?

cleaned_df=pivot.dropna()
print(cleaned_df)

Empty DataFrame
Columns: [France, UK, USA]
Index: []